In [1]:
import pandas as pd

tabela = pd.read_excel('marica.xlsx', sheet_name='BDI_20211207', dtype={'Distrito': str,}, usecols='B:E,G,N,AP,AS')
tabela.head()

,j01_Matricula,j23_Área do Terreno,j23_Valor M² do Terreno,j23_Valor Venal Terreno,j34_Setor,Distrito,Valor m² (ITBI),Valor Venal (ITBI)
0,106995,300.0,56.63,16989.00,999,1,867.0,"260.000,00"
1,106996,360.0,56.63,20386.80,999,1,NaN,NaN
2,106997,285.0,56.63,16139.55,999,1,NaN,NaN
3,107005,2457.0,56.63,139139.91,999,1,NaN,NaN
4,107006,300.0,56.63,16989.00,999,1,NaN,NaN

In [2]:
tabela.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 142505 entries, 0 to 142504
Data columns (total 8 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   j01_Matricula            142505 non-null  int64
 1   j23_Área do Terreno      141638 non-null  float64
 2   j23_Valor M² do Terreno  141638 non-null  float64
 3   j23_Valor Venal Terreno  141638 non-null  float64
 4   j34_Setor                142505 non-null  int64
 5   Distrito                 142505 non-null  object
 6   Valor m² (ITBI)          15717 non-null   float64
 7   Valor Venal (ITBI)       15744 non-null   object
dtypes: float64(4), int64(2), object(2)
memory usage: 8.7+ MB

In [3]:
tabela = tabela.dropna(how="any", subset=['j23_Valor M² do Terreno', 'j34_Setor'])
tabela.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 141638 entries, 0 to 142504
Data columns (total 8 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   j01_Matricula            141638 non-null  int64
 1   j23_Área do Terreno      141638 non-null  float64
 2   j23_Valor M² do Terreno  141638 non-null  float64
 3   j23_Valor Venal Terreno  141638 non-null  float64
 4   j34_Setor                141638 non-null  int64
 5   Distrito                 141638 non-null  object
 6   Valor m² (ITBI)          15717 non-null   float64
 7   Valor Venal (ITBI)       15718 non-null   object
dtypes: float64(4), int64(2), object(2)
memory usage: 9.7+ MB

In [4]:
media_distritos = tabela.groupby('Distrito').mean()
media_distritos

,j01_Matricula,j23_Área do Terreno,j23_Valor M² do Terreno,j23_Valor Venal Terreno,j34_Setor,Valor m² (ITBI)
Distrito,,,,,,
1,66475.986724,1039.169976,67.848765,33557.294474,8828.004828,619.573948
2,58593.930590,1068.059596,38.663163,22102.876963,9037.211509,653.333513
3,96644.504308,880.479105,37.292970,24856.935904,8877.884827,403.898833
4,97119.384309,708.419792,62.336560,29990.530795,8930.555106,912.139749

In [18]:
tabela.max()

C:\Users\carlos.dias\AppData\Local\Temp\ipykernel_496\1895904173.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  tabela.max()

j01_Matricula                   157137
j23_Área do Terreno          7958388.0
j23_Valor M² do Terreno         329.17
j23_Valor Venal Terreno    12645339.98
j34_Setor                         9235
Distrito                             4
Valor m² (ITBI)               382979.0
dtype: object

In [22]:
tabela.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 141638 entries, 0 to 142504
Data columns (total 8 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   j01_Matricula            141638 non-null  int64
 1   j23_Área do Terreno      141638 non-null  float64
 2   j23_Valor M² do Terreno  141638 non-null  float64
 3   j23_Valor Venal Terreno  141638 non-null  float64
 4   j34_Setor                141638 non-null  int64
 5   Distrito                 141638 non-null  object
 6   Valor m² (ITBI)          15717 non-null   float64
 7   Valor Venal (ITBI)       15718 non-null   object
dtypes: float64(4), int64(2), object(2)
memory usage: 9.7+ MB